app/Controllers/CommodityDetailController.php

SELECT *
FROM `tb_komoditas`
WHERE `slug_id` = 'mineral-batu-bara'
 LIMIT 1
---
    public function detail($slug = null)
    {
        $locale = $this->request->getLocale();

        $commodityData = $this->komoditasModel->where('slug_id', $slug)->first();