app/Controllers/ContactController.php

    public function index()
    {
        $locale = service('request')->getLocale();

        // Mengambil data meta untuk halaman kontak
        $metaData = $this->metaModel->where('slug_meta_id', 'kontak')->first();

        // Mengambil data kontak dari model
        $kontakData = $this->kontakModel->first();
---
SELECT *
FROM `tb_kontak`
 LIMIT 1