app/Controllers/Home.php

    public function index(): string
    {
        $locale = service('request')->getLocale();

        // 1. Ambil Meta Beranda
        // Note: Adjust 'nama_halaman_id' value if it's different in your database
        $meta = $this->metaModel->where('nama_halaman_id', 'Beranda')->first();

        // 2. Data Lainnya
        $latestNews = $this->artikelModel->orderBy('created_at', 'DESC')->limit(3)->findAll();
        $members    = $this->anggotaModel->findAll();
        $slider     = $this->sliderModel->findAll();
        $kontak     = $this->kontakModel->first();
        $commodities = $this->komoditasModel->orderBy('created_at', 'ASC')->limit(4)->findAll();
        $tentang = $this->tentangModel->first(); // Fetch "tentang" data

        // 3. Ambil Deskripsi Khusus (Komoditas & Anggota)
        $commodity_meta = $this->metaModel->where('nama_halaman_id', 'Komoditas')->first();
        $members_meta = $this->metaModel->where('nama_halaman_id', 'Anggota')->first();
---
SELECT *
FROM `tb_meta`
WHERE `nama_halaman_id` = 'Beranda'
 LIMIT 1
SELECT *
FROM `tb_artikel`
ORDER BY `created_at` DESC
 LIMIT 3
SELECT *
FROM `tb_anggota`
SELECT *
FROM `tb_slider`
SELECT *
FROM `tb_kontak`
 LIMIT 1
SELECT *
FROM `tb_komoditas`
ORDER BY `created_at` ASC
 LIMIT 4
SELECT *
FROM `tb_tentang`
 LIMIT 1
SELECT *
FROM `tb_meta`
WHERE `nama_halaman_id` = 'Komoditas'
 LIMIT 1
SELECT *
FROM `tb_meta`
WHERE `nama_halaman_id` = 'Anggota'
 LIMIT 1