app/Controllers/Karir.php

    public function index()
    {
        $locale = service('request')->getLocale();

        // Mengambil data lowongan dengan paginasi
        $lowongan = $this->lowonganModel->paginate(5, 'default');

        // Mengambil konten halaman karir dari KarirModel (baris pertama)
        $karirPage = $this->karirModel->first();
---
SELECT *
FROM `tb_lowongan`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `tb_lowongan`
SELECT *
FROM `tb_karir`
 LIMIT 1

    public function detail($slug)
    {
        $locale = service('request')->getLocale();
        $job = $this->lowonganModel->where('slug_lowongan_id', $slug)->first();
---
SELECT *
FROM `tb_lowongan`
WHERE `slug_lowongan_id` = 'senior-staff-back-office'
 LIMIT 1