app/Controllers/MemberController.php

SELECT *
FROM `tb_meta`
WHERE `slug_meta_id` = 'halaman-anggota'
 LIMIT 1
SELECT *
FROM `tb_anggota`
 LIMIT 6, 6
SELECT COUNT(*) AS `numrows`
FROM `tb_anggota`
---
    public function index()
    {
        $locale = service('request')->getLocale();

        // Mengambil data meta untuk halaman anggota
        $meta = $this->metaModel->where('slug_meta_id', 'halaman-anggota')->first();

        // Mengambil data anggota dari model dengan paginasi, 6 per halaman
        $data['members'] = $this->anggotaModel->paginate(6, 'default');