app/Controllers/Profil.php

SELECT *
FROM `tb_tentang`
 LIMIT 1
---
    public function index()
    {
        $locale = service('request')->getLocale();

        // Mengambil data profil perusahaan (baris pertama dari tabel tb_tentang)
        $profil = $this->tentangModel->first();